#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      - client_id       = "39739182-1a94-4c27-89d4-9243adad8c6e" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "c2c13bd5-09e4-4787-a317-780de81cc2e8" -> null
      - name            = "idir_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "39739182-1a94-4c27-89d4-9243adad8c6e" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "c5e7ac91-f8b3-45ad-9606-2e79cb7458be" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "CONFIDENTIAL" -> null
      - client_id                                = "kuro-mar-07-b-ce-id-basic-test-6370" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - description                              = "CSS App Created" -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = false -> null
      - id                                       = "39739182-1a94-4c27-89d4-9243adad8c6e" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "kuro-mar-07-b-ce-id-basic-test-6370" -> null
      - realm_id                                 = "onestopauth-basic" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "http://bceidDev.com",
          - "http://devchange.com",
        ] -> null
      - web_origins                              = [] -> null
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
      ~ access_type                              = "PUBLIC" -> "CONFIDENTIAL"
        id                                       = "df208b9c-cff1-4a1b-a3fd-5fb1ed52cdde"
        name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      - pkce_code_challenge_method               = "S256" -> null
      ~ valid_redirect_uris                      = [
          + "http://devchange.com",
            # (1 unchanged element hidden)
        ]
      ~ web_origins                              = [
          - "+",
          - "http://bceidDev.com",
        ]
        # (12 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_prod.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "kuro-mar-07-b-ce-id-both-test-6372"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://prodtest.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.access_token_aud will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"       = "true"
          - "id.token.claim"           = "false"
          - "included.client.audience" = "kuro-mar-07-b-ce-id-basic-test-6370"
        } -> null
      - id              = "1b64a3b3-42d5-41ec-9aaa-655d6c0a2b4d" -> null
      - name            = "access_token_aud" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-audience-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "872a5321-153b-4710-b687-f7e8342ab576" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "28d8f379-a834-4272-8498-92eafc62f09f" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "c02400f5-b52e-49e8-9689-53cecb47bb0d" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-basic-test-6370"
        } -> null
      - id              = "6ab349c6-084b-4fc9-8ac1-2ec4c5265bfa" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.display_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "display_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "displayName"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "6105a57d-9a72-41dc-8b55-3d778cd3131c" -> null
      - name            = "display_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "00f64cdf-473d-43a3-8979-ff7360410515" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "1e8f6145-faff-4d47-8d7d-408f4f121464" -> null
      - name            = "idir_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "628bdcb5-96df-4128-b899-4896892d6a60" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "CONFIDENTIAL" -> null
      - client_id                                = "kuro-mar-07-b-ce-id-basic-test-6370" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - description                              = "CSS App Created" -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = false -> null
      - id                                       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "kuro-mar-07-b-ce-id-basic-test-6370" -> null
      - realm_id                                 = "onestopauth-basic" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "http://bceidTest.com",
          - "http://testchange.com",
        ] -> null
      - web_origins                              = [] -> null
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
      ~ access_type                              = "PUBLIC" -> "CONFIDENTIAL"
        id                                       = "9f2cf24a-37c6-49d3-bcf9-584542649d90"
        name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      - pkce_code_challenge_method               = "S256" -> null
      ~ valid_redirect_uris                      = [
          + "http://testchange.com",
            # (1 unchanged element hidden)
        ]
      ~ web_origins                              = [
          - "+",
          - "http://bceidTest.com",
        ]
        # (11 unchanged attributes hidden)
    }

Plan: 10 to add, 2 to change, 20 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 4260 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*